export const allCity = [
  {
    COUNTYNAME: '新北市',
    coordinates: [121.3010761718761, 25.629588592125955],
  },
  {
    COUNTYNAME: '臺北市',
    coordinates: [121.83940625000065, 25.58996052100295],
  },
  {
    COUNTYNAME: '基隆市',
    coordinates: [122.23491406250025, 25.212841045367327],
  },
  {
    COUNTYNAME: '宜蘭縣',
    coordinates: [122.14702343750037, 24.53507815367678],
  },
  {
    COUNTYNAME: '桃園市',
    coordinates: [120.96050000000014, 25.35191687036115],
  },
  {
    COUNTYNAME: '新竹市',
    coordinates: [120.67485546875037, 25.053702431179147],
  },
  {
    COUNTYNAME: '新竹縣',
    coordinates: [121.26811718750116, 24.585039911089595],
  },
  {
    COUNTYNAME: '苗栗縣',
    coordinates: [120.42216992187565, 24.73480551588132],
  },
  {
    COUNTYNAME: '臺中市',
    coordinates: [120.21342968750076, 24.425092301008064],
  },
  {
    COUNTYNAME: '彰化縣',
    coordinates: [120.00468945312599, 24.054437462726355],
  },
  {
    COUNTYNAME: '雲林縣',
    coordinates: [119.83989453125116, 23.642458614982942],
  },
  {
    COUNTYNAME: '嘉義市',
    coordinates: [119.80693554687616, 23.299830169901185],
  },
  {
    COUNTYNAME: '嘉義縣',
    coordinates: [120.70781445312537, 23.380528588177825],
  },
  {
    COUNTYNAME: '臺南市',
    coordinates: [119.74101757812622, 22.85511688627483],
  },
  {
    COUNTYNAME: '高雄市',
    coordinates: [119.96074414062605, 22.500324261311945],
  },
  {
    COUNTYNAME: '屏東縣',
    coordinates: [120.25737500000076, 21.991897787346687],
  },
  {
    COUNTYNAME: '臺東縣',
    coordinates: [121.48784375000093, 22.45971822609765],
  },
  {
    COUNTYNAME: '南投縣',
    coordinates: [121.03740429687633, 23.94403521974256],
  },
  {
    COUNTYNAME: '花蓮縣',
    coordinates: [121.9163105468756, 23.592127949047708],
  },
  {
    COUNTYNAME: '澎湖縣',
    coordinates: [119.33011053197657, 23.65851486248023],
  },
  { COUNTYNAME: '金門縣', coordinates: [118.526741673591, 24.124645450276688] },
  { COUNTYNAME: '連江縣', coordinates: [120.2542596880221, 26.0717207660021] },
]

export const stations = [
  '新北',
  '臺北',
  '基隆',
  '花蓮',
  '宜蘭',
  '金門',
  '澎湖',
  '臺南',
  '高雄',
  '臺中',
  '新竹',
  '臺東',
  '馬祖',
  '恆春', // 屏東
  '新屋', // 桃園
  '日月潭', // 南投
  '國一N094K', // 新竹市
  '彰師大', // 彰化
  '麥寮', // 雲林
  '國一N142K', // 苗栗
  '嘉義', // 嘉義市
  '阿里山', // 嘉義縣
]

export const observation = [
  '基隆',
  '板橋',
  '大同',
  '桃園',
  '湖口',
  '新竹',
  '苗栗',
  '豐原',
  '彰化',
  '南投',
  '斗六',
  '新港',
  '臺西',
  '嘉義',
  '新營',
  '左營',
  '潮州',
  '臺東',
  '花蓮',
  '宜蘭',
  '馬祖',
  '馬公',
  '金門',
]
